Autodesk.Navisworks.Api.Plugins.PluginRecord
Metadata for a plugin that can be loaded into Navisworks.
The information in PluginRecord is available even if the corresponding Plugin hasn’t been loaded.

Autodesk.Navisworks.Api.Plugins.PluginRecord.DeveloperId
Gets the 4 character ADN developer code or a GUID. The combination of this and Name should make the plugin unique

Autodesk.Navisworks.Api.Plugins.PluginRecord.DisplayName
Text to display in the Navisworks GUI.

Autodesk.Navisworks.Api.Plugins.PluginRecord.ExtendedToolTip
Extended Tooltip to display when the Plugin is highlighted in the Navisworks GUI

Autodesk.Navisworks.Api.Plugins.PluginRecord.FindInterfaceRecord(System.String)
Finds an InterfaceRecord
interfaceId:
The Id of the InterfaceRecord
Returns:
null if the InterfaceRecord cannot be found

Autodesk.Navisworks.Api.Plugins.PluginRecord.HasAttemptedCreate
Determines if an attempt has been made to create the Plugin.

Autodesk.Navisworks.Api.Plugins.PluginRecord.HasFailedCreate
Determines if an attempt has been made to create the plugin, and it has failed.

Autodesk.Navisworks.Api.Plugins.PluginRecord.HasFailedIsSelfEnabled
Where SupportsIsSelfEnabled is true then the plugin
will be created early and IsSelfEnabled
will be called to determine the result.
Will return false if the plugin could not be created to make the call.

Autodesk.Navisworks.Api.Plugins.PluginRecord.Id
The full identifier for the plugin. This is formed as
Name.DeveloperId

Autodesk.Navisworks.Api.Plugins.PluginRecord.InterfaceRecords
Returns a collection of InterfaceRecords that declare which interfaces we support

Autodesk.Navisworks.Api.Plugins.PluginRecord.IsEnabled
Gets whether the Plugin is currently enabled for use or not.

Autodesk.Navisworks.Api.Plugins.PluginRecord.IsLoaded
Gets whether the Plugin is currently loaded

Autodesk.Navisworks.Api.Plugins.PluginRecord.LoadedPlugin
Gets the plugin if loaded, otherwise null

Autodesk.Navisworks.Api.Plugins.PluginRecord.LoadPlugin
Returns the plugin, loads it if required
Throws Autodesk.Navisworks.Api.Plugins.PluginLoadException: Plugin failed to load

Autodesk.Navisworks.Api.Plugins.PluginRecord.Name
Gets the name of the Plugin. The combination of this and DeveloperId should make the plugin unique

Autodesk.Navisworks.Api.Plugins.PluginRecord.PluginOptions
Gets flags for how plugins run

Autodesk.Navisworks.Api.Plugins.PluginRecord.SupportsIsSelfEnabled
Determines if IsSelfEnabled will be called.

Autodesk.Navisworks.Api.Plugins.PluginRecord.ToolTip
Tooltip to display when the Plugin is highlighted in the Navisworks GUI

Autodesk.Navisworks.Api.Plugins.PluginRecord.TryLoadPlugin
Returns the plugin, loads it if required
Returns:
null if plugin failed to load